//2. Напишите программу, которая на вход принимает число
// и выдает его квадрат (число умноженное на само себя).
//4 -> 16
//-3 -> 9
//-7 -> 49
int a = int.Parse(Console.ReadLine()!);

Console.Write(a*a);
